Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.rhea-so.aws_route53_zone.domain will be created
+ resource "aws_route53_zone" "domain" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "rhea-so.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.production.module.atlantis-rhea-so.aws_route53_record.domain must be replaced
-/+ resource "aws_route53_record" "domain" {
      ~ fqdn            = "atlantis.rhea-so.com" -> (known after apply)
      ~ id              = "Z007496927OLC0YXP6DHX_atlantis.rhea-so.com_A" -> (known after apply)
        name            = "atlantis.rhea-so.com"
      ~ zone_id         = "Z007496927OLC0YXP6DHX" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.production.module.rhea-so.aws_route53_zone.domain will be destroyed
  # (because aws_route53_zone.domain is not in configuration)
- resource "aws_route53_zone" "domain" {
      - arn           = "arn:aws:route53:::hostedzone/Z007496927OLC0YXP6DHX" -> null
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z007496927OLC0YXP6DHX" -> null
      - name          = "rhea-so.com" -> null
      - name_servers  = [
          - "ns-1158.awsdns-16.org",
          - "ns-1997.awsdns-57.co.uk",
          - "ns-73.awsdns-09.com",
          - "ns-811.awsdns-37.net",
        ] -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - zone_id       = "Z007496927OLC0YXP6DHX" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
